website_99cats/app/views/cat_rental_requests/new.html.erb

        <option disabled>-- Select a cat --</option>
        <% Cat.all.each do |cat| %>
---
SELECT "cats".* FROM "cats"