art-share-api/app/controllers/comments_controller.rb

SELECT "comments".* FROM "comments" WHERE "comments"."user_id" = $1  [["user_id", 2]]
SELECT "comments".* FROM "comments" WHERE "comments"."artwork_id" = $1  [["artwork_id", 6]]
---
    def index
        case
        when params[:user_id]
            comments = Comment.where(user_id: params[:user_id])
        when params[:artwork_id]
            comments = Comment.where(artwork_id: params[:artwork_id])

INSERT INTO "comments" ("body", "user_id", "artwork_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["body", "Indeed, my friend."], ["user_id", 11], ["artwork_id", 6], ["created_at", "2021-07-14 14:47:19.056549"], ["updated_at", "2021-07-14 14:47:19.056549"]]
---
    def create
        comment = Comment.new(comment_params)
        if comment.save