art-share-api/app/controllers/users_controller.rb

    def update
        user = User.find(params[:id])
        if user.update_attributes(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "users" SET "username" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["username", "Nakamoto"], ["updated_at", "2021-07-14 11:27:39.697577"], ["id", 1]]