website_99cats/app/controllers/cat_rental_requests_controller.rb

    def create
        @rental_request = CatRentalRequest.new(cat_rental_request_params)
        if @rental_request.save
---
INSERT INTO "cat_rental_requests" ("cat_id", "start_date", "end_date", "status", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["cat_id", 4], ["start_date", "2021-07-09"], ["end_date", "2021-07-13"], ["status", "PENDING"], ["created_at", "2021-07-17 11:55:29.690617"], ["updated_at", "2021-07-17 11:55:29.690617"]]

    def current_cat_rental_request
        @rental_request ||= CatRentalRequest.includes(:cat).find(params[:id])
---
SELECT  "cat_rental_requests".* FROM "cat_rental_requests" WHERE "cat_rental_requests"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT "cats".* FROM "cats" WHERE "cats"."id" = $1  [["id", 1]]