website_99cats/app/controllers/cats_controller.rb

    def update
        @cat = Cat.find(params[:id])
        if @cat.update_attributes(cat_params)
---
SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
UPDATE "cats" SET "description" = $1, "name" = $2, "sex" = $3, "updated_at" = $4 WHERE "cats"."id" = $5  [["description", "        \r\n    "], ["name", "Josephine"], ["sex", "F"], ["updated_at", "2021-07-16 18:39:50.844455"], ["id", 7]]