music_app/app/controllers/bands_controller.rb

SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
    def edit
        @band = Band.find_by_id(params[:id])

SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "bands" SET "name" = $1, "updated_at" = $2 WHERE "bands"."id" = $3  [["name", "The Heart Strokes II"], ["updated_at", "2021-07-22 16:07:54.052398"], ["id", 1]]
---
    def update
        @band = Band.find(params[:id])

        if @band
            @band.update_attributes(band_params)

SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
DELETE FROM "bands" WHERE "bands"."id" = $1  [["id", 3]]
---
    def destroy
        @band = Band.find(params[:id])
        @band.destroy