music_app/app/controllers/notes_controller.rb

    def create
        note = current_user.notes.new(note_params)
        note.save
---
INSERT INTO "notes" ("content", "user_id", "track_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["content", "Hah, these are some intricate lyrics indeed."], ["user_id", 4], ["track_id", 1], ["created_at", "2021-07-22 21:20:43.256319"], ["updated_at", "2021-07-22 21:20:43.256319"]]