music_app/app/controllers/tracks_controller.rb

SELECT  "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def new
        @album = Album.find(params[:album_id])

INSERT INTO "tracks" ("name", "album_id", "ord", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Track Number One"], ["album_id", 1], ["ord", 1], ["created_at", "2021-07-22 19:51:45.513444"], ["updated_at", "2021-07-22 19:51:45.513444"]]
---
    def create
        @track = Track.new(track_params)

        if @track.save

SELECT  "tracks".* FROM "tracks" WHERE "tracks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def edit
        @track = Track.find(params[:id])

SELECT  "tracks".* FROM "tracks" WHERE "tracks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "tracks" SET "lyrics" = $1, "updated_at" = $2 WHERE "tracks"."id" = $3  [["lyrics", "These are the lyrics to my heart!\r\nOhoh oh woo oh ooohoh oh woo oh ooohoh\r\nWoo oh ooohoh oh woo oh oooh\r\nYeahh"], ["updated_at", "2021-07-22 21:26:53.419977"], ["id", 1]]
---
    def update
        @track = Track.find(params[:id])

        if @track.update_attributes(track_params)