website_99cats/app/models/cat_rental_request.rb

    def approve!
        raise 'not pending' unless self.status == 'PENDING'
        transaction do
            self.status = 'APPROVED'
            self.save!

            # when we approve this request, we reject all other overlapping requests for this cat.
            overlapping_pending_requests.each do |req|
---
UPDATE "cat_rental_requests" SET "status" = $1, "updated_at" = $2 WHERE "cat_rental_requests"."id" = $3  [["status", "APPROVED"], ["updated_at", "2021-07-17 11:46:38.102472"], ["id", 2]]
SELECT "cat_rental_requests".* FROM "cat_rental_requests" WHERE "cat_rental_requests"."id" != $1 AND "cat_rental_requests"."cat_id" = $2 AND NOT (start_date > '2021-07-15' OR end_date < '2021-06-30') AND (status = 'PENDING')  [["id", 2], ["cat_id", 1]]

    def deny!
        self.status = 'DENIED'
        self.save!
---
UPDATE "cat_rental_requests" SET "status" = $1, "updated_at" = $2 WHERE "cat_rental_requests"."id" = $3  [["status", "DENIED"], ["updated_at", "2021-07-17 11:57:35.803550"], ["id", 4]]

    def does_not_overlap_approved_request
        return if self.denied?

        unless overlapping_approved_requests.empty?
---
SELECT  1 AS one FROM "cat_rental_requests" WHERE "cat_rental_requests"."id" != $1 AND "cat_rental_requests"."cat_id" = $2 AND NOT (start_date > '2021-07-15' OR end_date < '2021-06-30') AND (status = 'APPROVED') LIMIT $3  [["id", 2], ["cat_id", 1], ["LIMIT", 1]]