open-v1/music_app/app/controllers/albums_controller.rb

SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
    def new
        @band = Band.find(params[:band_id])

INSERT INTO "albums" ("name", "band_id", "year", "live", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "The First Album"], ["band_id", 2], ["year", 2004], ["live", true], ["created_at", "2021-07-22 19:05:42.309180"], ["updated_at", "2021-07-22 19:05:42.309180"]]
---
    def create
        @album = Album.new(album_params)

        if @album.save

SELECT  "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "albums" SET "year" = $1, "updated_at" = $2 WHERE "albums"."id" = $3  [["year", 2005], ["updated_at", "2021-07-22 19:05:51.763960"], ["id", 1]]
---
    def update
        @album = Album.find(params[:id])

        if @album.update_attributes(album_params)